Repository: norrdev/OpenGym
Catalog: lib/l10n/intl_*.arb
Languages: ru

source: About
ru: О приложении

# absiAgeValidation
source: Please, enter you age. ABSI calculator is only for people 2 or much years old.
ru: Пожалуйста, введите возраст. Можно расчитать ABSI только для людей, старше 2 лет.

# absiMean
source: Average ABSI of people in your age and same gender
ru: Средний ABSI людей вашего пола и возраста

# absiPageDesc
source: A body shape index and mortality risk calculator.
ru: Расчёт индекса формы тела и риска преждевременной смерти.

# absiPageTitle
source: A body shape index (ABSI)
ru: Индекс формы тела (ABSI)

# absiRisk
source: Premature mortality risk
ru: Риск преждевременной смерти

# absiRisk1
source: Very Low
ru: Очень низкий.

# absiRisk2
source: Low
ru: Низкий.

# absiRisk3
source: Average
ru: Средний.

# absiRisk4
source: High
ru: Высокий.

# absiRisk5
source: Very High
ru: Очень выскокий.

# absiWaistCircumference
source: Waist circumference
ru: Объём талии

# absiWaistCircumferenceValidation
source: Please enter your waist circumference in centimeters.
ru: Пожалуйста, введите окружность талии.

source: Add
ru: Добавить

# addEx
source: Exercise added.
ru: Упражнение добавлено.

source: Age
ru: Возраст

# ageValidation
source: Please, enter you age.
ru: Пожалуйста, введите возраст.

source: Allow changes?
ru: Разрешить изменения?

# backup
source: Backup database
ru: Создать резервную копию БД

# bfpAthletes
source: Athletes
ru: Атлеты

# bfpAverage
source: Average
ru: Средний

# bfpCategory
source: Category
ru: Категория

# bfpEssential
source: Essential fat
ru: Необходимый жир

# bfpFitness
source: Fitness
ru: Фитнесс

# bfpObese
source: Obese
ru: Ожирение

# bfpPageTitle
source: Body fat percentage (BFP)
ru: Процент жира в теле (BFP)

source: BMI
ru: ИМТ

# bmi15_16
source: Severely underweight.
ru: Дефицит массы тела.

# bmi15
source: Very severely underweight.
ru: Выраженный дефицит массы тела.

# bmi16_18
source: Underweight.
ru: Недостаточная (дефицит) масса тела.

# bmi18_25
source: Normal (healthy weight).
ru: Нормальная масса тела.

# bmi25_30
source: Overweight.
ru: Избыточная масса тела (1 степень).

# bmi30_35
source: Obese Class I (Moderately obese).
ru: Ожирение (2a степень).

# bmi35_40
source: Obese Class II (Severely obese).
ru: Выраженное ожирение (2b степень).

# bmi40
source: Obese Class III (Very severely obese).
ru: Резко выраженное, морбидное ожирение (3 степень).

# bmiHeight
source: Your height
ru: Ваш рост

# bmiHeightValidation
source: Please enter your height.
ru: Пожалуйста, введите ваш рост

# bmiPageDesc
source: Calculate your Body Mass Index (WHO).
ru: Расчитайте индекс массы тела (методика ВОЗ).

# bmiPageTitle
source: Body Mass Index (BMI)
ru: Индекс массы тела (BMI)

# bmiWeight
source: Your weight
ru: Ваш вес

# bmiWeightValidation
source: Please enter your weight.
ru: Пожалуйста, введите ваш вес

source: Brzycki
ru: Бржицки

source: Calculate
ru: Рассчитать

source: Cancel
ru: Отмена

# ccontinue
source: Continue
ru: Продолжить

source: cm
ru: см

# cooperAverage
source: Average
ru: Удовлетворительно

# cooperBad
source: Bad
ru: Плохо

# cooperDistanse
source: Distanse
ru: Дистанция

# cooperDistanseValidation
source: Please, enter the distance.
ru: Пожалуйста, введите дистанцию.

# cooperExcellent
source: Excellent
ru: Отлично

# cooperGood
source: Good
ru: Хорошо

# cooperMark
source: Mark
ru: Оценка

# cooperPageDesc
source: Run 12 minutes as fast, as you can. And enter the distance in the field below. You can do it in a stadium, or using a fitness tracker with GPS.
ru: Тест на физическую подготовку, применяется в армии США. Для прохождения придётся побегать. Найдите стадион или беговую дорожку с отмеченным расстоянием (или используйте фитнесс-трекер с GPS) и замерьте, какое расстояние вы пробегаете за 12 минут непрерывного бега с максимально возможным для Вас усилием. Перед выполнением теста проконсультируйтесь с врачом, особенно, если у вас проблемы с сердечно-сосудистой системой.

# cooperPageTitle
source: Cooper test + VO max
ru: Тест Купера + VO max

# cooperStrongMinutes
source: The number of whole minutes to complete 4 cycles
ru: Количество целых минут на выполнение 4-х циклов

# cooperStrongMinutesValidation
source: Please, enter number.
ru: Пожалуйста, введите число.

# cooperStrongPageDesc
source: Another type of Cooper's strength endurance test, also no less common (created for the US military, but also used by sportsmen and military personnel of other countries), includes 4 repetitions of the following set of exercises: - do 10 push-ups and stay in support lying; - leaning on our hands with a jump, we bring our legs to our hands, squatting and then back 10 times; - we turn on our back and put our legs behind our heads 10 times (the exercise is performed lying on our back); - 10 jumps with a change of legs and touching the knee to the ground.
ru: Ещё один вид теста Купера на силовую выносливость, также не менее распространенный (изначально созданный для военнослужащих армии США, но также используемый спорстменами и военнослужащими других стран, включая РФ), включает в себя 4 повтора следующего комплекса упражнений: – делаем 10 отжиманий и остаёмся в упоре лёжа; – опираясь на руки прыжком ноги подносим к рукам в упор присев и потом обратно 10 раз; – переворачиваемся на спину и 10 раз вынос ног за голову (упражнение выполняется лёжа на спине); – 10 подпрыгиваний со сменой ног и касаясь коленом земли.

# cooperStrongPageTitle
source: Cooper army test
ru: Тест Купера на силовую выносливость

# cooperTerrible
source: Terrible
ru: Ужасно

# copyright
source: Â© Denis Filonov
ru: © Denis Filonov

source: Current workout
ru: Текущая тренировка

source: Current program
ru: Текущая программа

# dayAdd
source: Add day
ru: Добавить день

# canNotDelDay
source: You can only delete a programme day that has never been practised.
ru: Можно удалить только тот день программы, по которому ни разу не занимались.

# dbImportedFrom
source: Database imported from
ru: База данных импортирована из

source: Delete
ru: Удалить

# desc
source: Description
ru: Описание

source: Edit
ru: Правка

# enterText
source: Please enter some text
ru: Введите текст

source: Epley
ru: Эпли

# exDesc
source: Exercise description
ru: Описание упражнения

# exName
source: Exercise name
ru: Название упражнения

source: Equipment
ru: Оборудование

source: Female
ru: Женский

source: Finish
ru: Закончить

source: from
ru: из

source: Gender
ru: Пол

# homePageBody
source: Body form
ru: Физическая форма

# homePageFood
source: Food
ru: Еда

# homePagePower
source: Strength and endurance
ru: Сила и выносливость

# homePageProportions
source: Body proportions
ru: Пропорции тела

# ifpTotalWeight
source: Total weight
ru: Общий вес

# import
source: Import database
ru: Импортировать БД

# importWarning
source: This option will overwrite all data with imports and exit the application. Make a backup!
ru: Эта опция приведёт к перезаписи всех данных импортируемыми и выходу из приложения. Сделайте резервную копию!

# inch
source: in
ru: дюймы

# isAthlete
source: Are you a professional athlete?
ru: Вы профессиональный спортсмен?

source: Lander
ru: Ландер

# lbmPageDescription
source: Fat-free body mass.
ru: Масса тела без учёта жира.

# lbmPageTitle
source: Lean Body Mass
ru: Мышечная масса

source: Licenses
ru: Лицензии

source: Log
ru: Дневник

source: Lombardi
ru: Ломбарди

# loadStr
source: Load
ru: Вид нагрузки

source: left
ru: левые

source: Male
ru: Мужской

source: Mayhew
ru: Мэхью

# mcBicep
source: Bicep girth
ru: Обхват бицепса

# mcButt
source: Girth of the buttocks
ru: Обхват ягодиц

# mcCalf
source: Calf circumference
ru: Обхват голени

# mcChest
source: Chest girth
ru: Обхват груди

# mcForearm
source: Forearm girth
ru: Обхват предплечья

# mcNeck
source: Neck girth
ru: Обхват шеи

# mcPageDesc
source: Ideal Body Proportions Formula For the Natural Athlete (McCallum).
ru: Расчёт идеальных пропорций тела по МакКаллуму для натурального бодибилдера.

# mcPageTitle
source: Body proportions (McCallum)
ru: Пропорции тела (МакКаллум)

# mcPart
source: Body part
ru: Часть тела

# mcrobertMax
source: Maximum
ru: Максимум

# mcrobertMin
source: Minimum
ru: Минимум

# mcrobertPageDesc
source: Ideal Body Proportions Formula For the Natural Athlete (McRobert).
ru: Расчёт идеальных пропорций тела по МакРоберту для натурального бодибилдера.

# mcrobertPageTitle
source: Body proportions (McRobert)
ru: Пропорциии тела (МакРоберт)

# mcThigh
source: Thigh girth
ru: Обхват бедра

# mcWaist
source: Waist
ru: Обхват талии

# mcWrist
source: Wrist girth
ru: Обхват запястья

# mcWristValidation
source: Enter your wrist circumference.
ru: Введите обхват запястья.

source: min.
ru: мин.

source: Muscles
ru: Мышцы

source: Name
ru: Название

source: No
ru: Нет

# noDesc
source: No description.
ru: Нет описания.

# noex
source: No exercises on this day.
ru: В этом дне нет упражнений.

source: Nothing selected
ru: Ничего не выбрано

source: O`Conner
ru: О`Коннор

# pageAddEx
source: Add exercise
ru: Добавить упражнение

# pageDaysTitle
source: Days
ru: Дни

# pageExerciseTitle
source: Exercises
ru: Упражнения

# pageProgramsTitle
source: Programs
ru: Программы

# pageWorkout
source: Workout
ru: Тренировка

# programAdd
source: Add program
ru: Добавить программу

# preinstalledEx
source: Preinstalled exercise
ru: Предустановленное упражнение

source: Rename
ru: Переименовать

source: Repeats
ru: Повторы

# rest
source: Rest time (sec)
ru: Отдых (сек)

# restButton
source: Save & rest
ru: Сохранить и отдохнуть

# restore
source: Restore from backup
ru: Восстановить из резервной копии БД

# rfmPageDescription
source: Relative fat mass in % calculation.
ru: Расчёт относительной массы жира в процентах.

# rfmPageTitle
source: Relative fat mass (RFM)
ru: Относительная масса жира (RFM)

# rmBarebellWeight
source: Weight of barebell
ru: Вес снаряда

# rmBarebellWeightValidation
source: Please, enter weight of barbell.
ru: Введите вес снаряда.

# rmMethod
source: Method
ru: Метод

# rmPageDesc
source: 1 RM calculation by different methods.
ru: Расчёт повторного максимума по разным методикам.

# rmPageTitle
source: 1 RM calculation
ru: Повторный максимум

# rmRepeats
source: Repeats
ru: Количество повторов

# rmRepeatValidation
source: Enter repeats.
ru: Введите количество повторов.

# rmResult
source: Result
ru: Результат

source: Save
ru: Сохранить

# saveToFile
source: Save database to file
ru: Сохранить БД в файл

source: Save to Log
ru: Сохранить в дневник

# selectProgram
source: Select or create program first
ru: Cоздайте или выберите программу

source: Sets
ru: Подходы

# setsText
source: Perform the set, and when you're done, press the button.
ru: Выполните подход, и когда закончите, нажмите кнопку.

source: Settings
ru: Настройки

# share
source: Share database
ru: Экспортировать БД

source: Skip
ru: Пропустить

# skipDialog
source: Are you really want to skip this exercise today?
ru: Вы действительно хотите не выполнять это упражнение сегодня?

source: Start
ru: Старт

# stopRest
source: Stop the rest
ru: Прервать отдых

source: Timer
ru: Таймер

# title
source: NpNg
ru: OpenGym

source: Total
ru: Всего

source: Time
ru: Время

# useImperialUS
source: Use Imperial/US system (lbs, in, miles)?
ru: Использовать английскую систему мер (фунты, дюймы, мили)?

source: Wathan
ru: Ватан

source: Weight
ru: Вес

source: Wilks
ru: Вилкс

source: Workout finished
ru: Тренировка завершена

source: Workout in progress
ru: Тренировка в процессе.

# wrkBegin
source: Workout begin
ru: Начало тренировки

# wrkDuration
source: Workout duration
ru: Продолжительность тренировки

# wrkEnd
source: Workout end
ru: Конец тренировки

# wrkTrainingVolume
source: Training volume
ru: Объём тренировки

source: Yes
ru: Да

source: One bar or no bar
ru: Один гриф или нет грифа

source: Two bars
ru: Два грифа

# twoLimbsWorksTogether
source: Both limbs work simultaneously or one muscle group works
ru: Обе конечности работают одновременно или работает одна мышечная группа

# limbsWorkAlt
source: Limbs work alternately or separately
ru: Конечности работают попеременно или раздельно

source: right
ru: правые

# hintWorkout
source: This is your current workout program. Tap on the day in the list to begin training. Select another program you can on the Programs screen.
ru: Это ваша текущая программа тренировок. Нажмите на день в списке, чтобы начать тренировку. Выбрать другую программу вы можете на экране Программы.

# hintWorkoutProcess
source: This is the list of current-day exercises. Tap on the exercise to change its parameters (sets, weights), and drag the exercise up or down to change order. Press Start to begin training.
ru: Это ваша текущая программа тренировок. Нажмите на день в списке, чтобы начать тренировку. Нажмите кнопку +, чтобы добавить день, нажмите кнопку 📁, чтобы просмотреть список программ и выбрать программу по умолчанию. Проведите вправо для редактирования и удаления дня.

# hintWorkoutSets
source: Run a set and enter its parameters. You can increase or decrease the number of sets. Press Save & rest to rest and to prepare for the next set.
ru: Выполните сет и введите его параметры. Вы можете увеличить или уменьшить количество сетов. Нажмите Сохранить & отдохнуть, чтобы отдохнуть и подготовиться к следующему сету

# hintPrograms
source: Select radio to change the current workout. Swipe right to edit the name of the program. Tap + button on the navigation bar to create a new program.
ru: Нажмите на селектор в левой колонке, чтобы изменить текущую тренировку. Проведите вправо, чтобы изменить название программы. Нажмите на программу, чтобы увидеть дни программы. Нажмите кнопку + на панели навигации, чтобы создать новую программу.

# hintProgramsDay
source: This is the workout day plan. Drug exercises up or down to change order. Press + button to add a new exercise. Swipe right to edit say's name.
ru: Это план дня тренировки. Перемещайте упражнения вверх или вниз, чтобы изменить порядок. Нажмите кнопку +, чтобы добавить новое упражнение. Проведите пальцем вправо, чтобы изменить название.

# hintProgramsDays
source: Days of the workout. Tap + button to add a new day. Swipe right to edit the day's name. Tap day to add or remove exercises.
ru: Дни тренировки. Нажмите кнопку +, чтобы добавить новый день. Проведите вправо, чтобы изменить название дня. Нажмите на день, чтобы добавить или удалить упражнения.

# hintProgramsAddEx
source: Select muscle group and tap + button in exercises list.
ru: Выберите группу мышц и нажмите кнопку + в списке упражнений.

# hintEx
source: Tap on the muscle group in the list to show exercises.
ru: Нажмите на группу мышц в списке, чтобы показать упражнения.

# hintExByMuscle
source: Tap + button to add a new exercise. Tap on exercise in the list to view parameters and descriptions. Swipe right to edit exercise.
ru: Нажмите кнопку +, чтобы добавить новое упражнение. Нажмите на упражнение в списке, чтобы просмотреть параметры и описание. Проведите пальцем вправо, чтобы отредактировать упражнение.

# hintLogCalendar
source: Tap on the date to see workouts. Tap on workout in the dialog to see its log. Swipe left or right to change the month.
ru: Нажмите на дату, чтобы увидеть тренировки. Нажмите на тренировку в диалоге, чтобы просмотреть ее журнал. Проведите пальцем влево или вправо, чтобы изменить месяц.
